6/app/views/reviews/_form.html.erb

<%#This is the file for the review %>
<%= form_for [@book, @book.reviews.find(review.id)] do |f| %>
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ? AND "reviews"."id" = ? LIMIT ?  [["book_id", 11], ["id", 1], ["LIMIT", 1]]