6/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "classification", "genre", "edition", "description", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)
    @book.user = current_user

    respond_to do |format|
      if @book.save