6/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?)  [["body", "good book"], ["created_at", "2019-04-18 01:25:15.026002"], ["updated_at", "2019-04-18 01:25:15.026002"], ["user_id", 3], ["book_id", 11]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    @comment.book_id = @book.id
    if @comment.save!