6/app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "body" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["body", "new review"], ["updated_at", "2019-04-18 00:18:58.649529"], ["id", 1]]
---
  def update
    @review = Review.find(params[:id])
    if @review.update(review_params)

INSERT INTO "reviews" ("body", "created_at", "updated_at", "user_id", "book_id", "rating") VALUES (?, ?, ?, ?, ?, ?)  [["body", "ok book"], ["created_at", "2019-04-18 02:05:51.722928"], ["updated_at", "2019-04-18 02:05:51.722928"], ["user_id", 3], ["book_id", 12], ["rating", 3]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.book_id = @book.id

    if @review.save!

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_book
    #tells rails if the Reviews is for Reviews or for reviews
    @book = Book.find(params[:book_id])