6/app/views/users/profile.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
      <p>Email: <%= @user.email %></p>
      <p>Books in my library: <%= @user.books.size %></p>