6/app/views/books/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 12]]
---
        <% sum =0.0%>
        <%@book.reviews.each do |review| %>