6/app/views/comments/_form.html.erb

<%#this is the file for the review %>
<%= form_for [@book, @book.comments.find(comment.id)] do |f| %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."book_id" = ? AND "comments"."id" = ? LIMIT ?  [["book_id", 11], ["id", 1], ["LIMIT", 1]]